{
  "scenes": [
    {
      "start_time": 0,
      "end_time": 25,
      "visual": "The video begins with a black-and-white shot of Donald Trump standing at a podium labeled 'TECH PROSPERITY DEAL' alongside Keir Starmer. They are facing an audience of reporters. The setting is formal, with US and UK flags visible behind them and the room adorned with framed portraits and a floral arrangement."
    },
    {
      "start_time": 25,
      "end_time": 50,
      "visual": "The scene transitions to color, showing Trump and Starmer standing at their respective podiums. The camera angle is slightly wider, revealing more of the room's interior. The audience is visible in the foreground, seated and facing the podiums. The setting remains formal, with wood-paneled walls and framed portraits."
    },
    {
      "start_time": 50,
      "end_time": 75,
      "visual": "Trump and Starmer are standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. The background features US and UK flags, adding a formal and diplomatic atmosphere. Trump is dressed in a dark suit with a red tie, while Starmer is in a dark suit with a blue tie. They appear engaged in a discussion, with Trump speaking while Starmer listens attentively."
    },
    {
      "start_time": 75,
      "end_time": 100,
      "visual": "The scene shows Trump and Starmer standing at their respective podiums. The camera angle remains static, focusing on the two leaders as they address the audience. The setting is formal, with a grand room that includes framed portraits and a piano, suggesting a significant event or announcement."
    },
    {
      "start_time": 100,
      "end_time": 125,
      "visual": "The video shows Trump and Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. They are flanked by US and UK flags. Trump is on the left, wearing a dark suit with a red tie, while Starmer is on the right, also in a dark suit but with a blue tie. Both men are looking down at their notes. The background features ornate decorations, adding a formal atmosphere to the setting."
    },
    {
      "start_time": 125,
      "end_time": 150,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. Starmer continues speaking while looking down at his notes. The audience consists of several individuals, some of whom are holding cameras and microphones, indicating they are reporters. The setting appears formal, with the audience attentively listening to the speaker."
    },
    {
      "start_time": 150,
      "end_time": 175,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. Trump stands at the podium labeled 'TECH PROSPERITY DEAL' while Starmer stands at the same podium. In the foreground, several individuals are seated, facing the podiums. A woman in a pink jacket is visible, holding a microphone and addressing the men. Behind her, a cameraperson is filming the event."
    },
    {
      "start_time": 175,
      "end_time": 200,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. Trump stands at the podium labeled 'TECH PROSPERITY DEAL' while Starmer stands at a similar podium. In the foreground, several individuals are seated, facing the podiums. A woman in a pink jacket is visible, holding a microphone and addressing the men at the podiums."
    },
    {
      "start_time": 200,
      "end_time": 225,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. Trump stands at the podium labeled 'TECH PROSPERITY DEAL' while Starmer stands at the same podium. In the foreground, several individuals are seated, facing the podiums. A woman in a pink jacket is visible, holding a microphone and addressing the men. Behind her, another person operates a video camera."
    },
    {
      "start_time": 225,
      "end_time": 250,
      "visual": "The camera focuses on the audience, specifically a female reporter who is asking a question. She is positioned in front of the podiums where Trump and Starmer are standing. She is holding a microphone and appears to be addressing the two leaders. The background shows the audience seated, with some individuals looking towards the reporter and others towards the podiums."
    },
    {
      "start_time": 250,
      "end_time": 275,
      "visual": "The scene returns to the initial setup with Trump and Starmer standing at their respective podiums. The background features the flags of the United States and the United Kingdom. Both individuals are dressed formally, with Trump wearing a dark suit and red tie, and Starmer in a dark suit and glasses. The podiums have signs reading 'TECH PROSPERITY DEAL.' The camera remains static, focusing on both men as they engage in the press conference."
    },
    {
      "start_time": 275,
      "end_time": 300,
      "visual": "The video shows Trump and Starmer standing at their respective podiums. The background features US and UK flags. Trump is on the left, wearing a dark suit with a red tie, while Starmer is on the right, also in a dark suit but with a blue tie. Both men are looking down at their podiums, possibly reading from notes. The camera remains static throughout this segment."
    },
    {
      "start_time": 300,
      "end_time": 325,
      "visual": "The scene shows Trump and Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. The background features US and UK flags. Trump is on the left side of the frame, wearing a dark suit with a red tie, while Starmer is on the right, also in a dark suit but with a blue tie. Both men are looking down at their podiums."
    },
    {
      "start_time": 325,
      "end_time": 350,
      "visual": "The scene shows Trump and Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. The background features US and UK flags. Trump is on the left side of the frame, wearing a dark suit with a red tie, while Starmer is on the right, also in a dark suit but with a blue tie. Both men are looking down at their podiums."
    },
    {
      "start_time": 350,
      "end_time": 375,
      "visual": "The scene shows Trump and Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. The background features US and UK flags. Trump is on the left side of the frame, wearing a dark suit with a red tie, while Starmer is on the right, also in a dark suit but with a blue tie. Both men are looking down at their podiums. At 375s, Trump begins to speak, and the camera angle changes to show the audience seated in front of the podiums."
    },
    {
      "start_time": 375,
      "end_time": 400,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. Trump is positioned at the left podium, while Starmer stands at the right podium. The audience appears attentive, with some individuals looking towards the speakers. The room's decor includes framed portraits on the wall behind the podiums, adding a formal ambiance to the setting."
    },
    {
      "start_time": 400,
      "end_time": 425,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. Trump is positioned at the left podium, while Starmer stands at the right podium. The audience appears attentive, with some individuals looking towards the speakers. The room's decor includes framed portraits on the wall behind the podiums, adding a formal ambiance to the setting."
    },
    {
      "start_time": 425,
      "end_time": 450,
      "visual": "The video shows Trump speaking at a podium with the words 'TECH PROSPERITY DEAL' written on it. He is wearing a dark suit with a red tie. To his right stands Starmer in a dark suit and glasses, also behind a similar podium. The background features flags of the United States and the United Kingdom. The camera angle remains static throughout this segment."
    }
  ]
}