{
  "scenes": [
    {
      "start_time": 0,
      "end_time": 25,
      "visual": "The video begins with a black-and-white shot of Donald Trump standing at a podium labeled 'TECH PROSPERITY DEAL' alongside Keir Starmer. They are in a formal room with wood-paneled walls, adorned with framed portraits and a floral arrangement. The American and British flags are prominently displayed behind them. A reporter is seen asking a question, and the camera captures the audience seated in front of the podiums."
    },
    {
      "start_time": 25,
      "end_time": 50,
      "visual": "The scene transitions to a slightly elevated camera angle, providing a view of the audience seated in front of the podiums. A reporter is seen asking a question, positioned among the audience, facing the podiums. The setting appears formal, with both leaders attentively listening to the reporter's question. The background includes framed portraits and a floral arrangement, adding to the official atmosphere of the event."
    },
    {
      "start_time": 50,
      "end_time": 75,
      "visual": "The camera angle remains static, showing Donald Trump and Keir Starmer standing at their respective podiums. The background features US and UK flags, and there are portraits and a piano visible. Both Trump and Starmer are looking down at their notes. The room has a formal setting with wood-paneled walls and a floral arrangement."
    },
    {
      "start_time": 75,
      "end_time": 100,
      "visual": "The scene continues with Donald Trump and Keir Starmer standing at their respective podiums. The background features US and UK flags, and there are portraits and a piano visible. A reporter is asking a question, and both Trump and Starmer are listening attentively. The camera angle remains steady, focusing on the two leaders as they prepare to respond."
    },
    {
      "start_time": 100,
      "end_time": 125,
      "visual": "Keir Starmer is speaking while Donald Trump listens attentively. The camera remains consistent, focusing on both individuals as they engage in the press conference. The setting is formal, with both leaders dressed in suits, and the audience is visible in the foreground, indicating a press conference environment."
    },
    {
      "start_time": 125,
      "end_time": 150,
      "visual": "Keir Starmer continues speaking while Donald Trump listens attentively. The camera remains static, focusing on both individuals as they engage in the press conference. The setting includes the podiums with the 'TECH PROSPERITY DEAL' sign, and the audience is attentively listening to the speaker."
    },
    {
      "start_time": 150,
      "end_time": 175,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. A woman in a pink jacket stands to the right of the podiums, holding a microphone and addressing the audience. She appears to be asking a question. The setting includes the podiums with the 'TECH PROSPERITY DEAL' sign, and the audience is attentively listening to the speaker."
    },
    {
      "start_time": 175,
      "end_time": 200,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. The audience consists of several individuals seated in rows, facing the podiums. A woman in a pink jacket is seen holding a microphone and addressing the man at the right podium. The man at the right podium is looking down at his notes, while the man at the left podium remains still."
    },
    {
      "start_time": 200,
      "end_time": 225,
      "visual": "The camera focuses on a woman holding a microphone, identified as a reporter. She is standing among other reporters, who are also holding microphones and cameras. The setting appears to be a formal press conference room, with the US and UK flags prominently displayed behind the podiums. The reporter is actively engaging with the audience, likely asking questions or providing updates."
    },
    {
      "start_time": 225,
      "end_time": 250,
      "visual": "The camera focuses on the audience, specifically a female reporter who is asking a question. The reporter is holding a microphone and appears to be addressing the two men at the podiums. The setting includes several individuals seated in front of the podiums, with the American and British flags prominently displayed behind them. The reporter's name is displayed as 'REPORTER' on the screen."
    },
    {
      "start_time": 250,
      "end_time": 275,
      "visual": "Keir Starmer is speaking while Donald Trump listens attentively. The camera remains static, focusing on both individuals. Keir Starmer appears to be addressing the audience, possibly responding to the reporter's question. The setting is formal, with both leaders dressed in suits, and the atmosphere seems serious and diplomatic."
    },
    {
      "start_time": 275,
      "end_time": 300,
      "visual": "The scene returns to the initial setup with Donald Trump and Keir Starmer standing at their respective podiums. The background features the US and UK flags, and the podiums have signs reading 'TECH PROSPERITY DEAL.' Keir Starmer is speaking while Donald Trump listens attentively. The camera remains static, focusing on both individuals."
    },
    {
      "start_time": 300,
      "end_time": 325,
      "visual": "The camera angle remains static, showing Donald Trump and another man standing at podiums with signs reading 'TECH PROSPERITY DEAL.' The background features US and UK flags. The man on the right continues speaking while Trump listens attentively. The room has wood-paneled walls adorned with framed portraits and a floral arrangement."
    },
    {
      "start_time": 325,
      "end_time": 350,
      "visual": "The scene shows Donald Trump and another man standing at podiums with signs reading 'TECH PROSPERITY DEAL.' The background features US and UK flags. Donald Trump is wearing a dark suit with a red tie, while the other man is in a dark suit with a light-colored tie. Both men are looking down at their podiums."
    },
    {
      "start_time": 350,
      "end_time": 375,
      "visual": "The man on the right continues speaking while Trump listens attentively. The camera remains static throughout this segment. At 375s, Trump begins to speak, and the camera angle changes to show the audience seated in front of the podiums. The room has wood-paneled walls adorned with framed portraits and a floral arrangement."
    },
    {
      "start_time": 375,
      "end_time": 400,
      "visual": "The scene shows Donald Trump at the podium addressing the audience. He is wearing a dark suit with a red tie. The background features flags of the United States and the United Kingdom, along with a sign that reads 'TECH PROSPERITY DEAL.' The camera angle is slightly lower than before, providing a view of the audience seated in front of the podiums."
    },
    {
      "start_time": 400,
      "end_time": 425,
      "visual": "The scene shows Donald Trump at a podium addressing the audience. He is wearing a dark suit with a red tie. The podium has a sign that reads 'TECH PROSPERITY DEAL.' Behind him, there are two flags, one American and one British. The setting appears formal, likely a press conference room. The camera angle is slightly wider, showing part of the audience seated in front of the podium."
    },
    {
      "start_time": 425,
      "end_time": 450,
      "visual": "The scene shows Donald Trump speaking at a podium with the words 'TECH PROSPERITY DEAL' written on it. He is wearing a dark suit with a red tie. To his right stands another man in a dark suit and glasses, who appears to be listening attentively. The background features flags of the United States and the United Kingdom. The camera angle remains static throughout this segment."
    }
  ]
}