{
  "scenes": [
    {
      "start_time": 0,
      "end_time": 25,
      "visual": "The video begins with a black-and-white shot of Donald Trump and another man standing behind podiums labeled 'TECH PROSPERITY DEAL.' The background features wood paneling, framed portraits, and a piano. The scene transitions to color, revealing the men in suits. The camera angle remains static, focusing on the two men at the podiums. The setting includes flags and a formal backdrop, emphasizing the official nature of the event."
    },
    {
      "start_time": 25,
      "end_time": 50,
      "visual": "Donald Trump and Keir Starmer stand at their respective podiums. The setting is formal, with flags of the United States and the United Kingdom prominently displayed behind them. The room has wood-paneled walls adorned with framed portraits and a floral arrangement. The camera angle remains steady, focusing on the two leaders as they engage in a discussion. There are no significant changes in the frame during this period, maintaining a consistent view of the press conference setting."
    },
    {
      "start_time": 50,
      "end_time": 75,
      "visual": "Donald Trump and Keir Starmer stand at their respective podiums. The background features US and UK flags, and the podiums have signs reading 'TECH PROSPERITY DEAL.' The camera zooms in slightly, focusing on both men. Trump appears to be speaking, while Starmer listens attentively. The setting is formal, with a grand room and portraits on the walls. The lighting is bright, highlighting the two figures prominently. There are no significant changes in the frame during this period."
    },
    {
      "start_time": 75,
      "end_time": 100,
      "visual": "The scene shows Donald Trump and Keir Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. They are flanked by US and UK flags. The setting appears formal, likely a press conference room, with both individuals dressed in suits. There are no significant actions or changes in the frame at this moment; it is a static shot capturing the two leaders at their podiums."
    },
    {
      "start_time": 100,
      "end_time": 125,
      "visual": "The scene continues with Donald Trump and Keir Starmer standing at their respective podiums. The setting remains consistent, with the flags of the United States and the United Kingdom behind them. Both men are dressed formally, with Trump wearing a dark suit and red tie, and Keir Starmer in a dark suit and glasses. The podiums have signs reading 'TECH PROSPERITY DEAL.' The camera angle remains steady, focusing on both individuals. There are no significant changes in the frame during this period."
    },
    {
      "start_time": 125,
      "end_time": 150,
      "visual": "The scene shows Donald Trump and Keir Starmer standing at podiums with the words 'TECH PROSPERITY DEAL' written on them. They are flanked by US and UK flags. The setting appears formal, likely a press conference room. Both men are dressed in suits, with Trump wearing a red tie and Keir Starmer in a dark suit. The camera remains static, focusing on the two men as they stand behind their podiums. There are no significant actions or changes in the frame during this time."
    },
    {
      "start_time": 150,
      "end_time": 175,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. Keir Starmer continues speaking while Trump listens attentively. The audience appears engaged, with some members looking towards the speaker and others taking notes. The setting remains formal, with the flags and podiums prominently displayed. The lighting is consistent, highlighting the speakers and the audience."
    },
    {
      "start_time": 175,
      "end_time": 200,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. The setting includes wooden paneling and framed portraits on the wall, adding a formal and historical ambiance to the room. A woman in a pink jacket is seen holding a microphone, indicating she is addressing the audience. Keir Starmer is now looking down at his notes, suggesting he is preparing to respond or continue his speech."
    },
    {
      "start_time": 200,
      "end_time": 225,
      "visual": "The camera angle shifts to show the audience and the two men at the podiums from behind. Keir Starmer, who was previously speaking, is now looking down at his notes. The audience is visible, with some members holding cameras and microphones, indicating they are reporters. The setting remains formal, with the flags and podiums still in view. Trump stands passively, maintaining his posture from the previous segment."
    },
    {
      "start_time": 225,
      "end_time": 250,
      "visual": "The camera angle remains unchanged, showing the two men at their podiums. Keir Starmer continues speaking while Trump listens attentively. The setting includes the flags of the United States and the United Kingdom behind them, and the podiums have signs reading 'TECH PROSPERITY DEAL.' There are no significant changes in the frame during this time."
    },
    {
      "start_time": 250,
      "end_time": 275,
      "visual": "The scene shows Donald Trump and another man standing at podiums. The setting appears formal, with flags of the United States and the United Kingdom visible behind them. Both men are dressed in suits, with Trump wearing a red tie. The podiums have signs that read 'TECH PROSPERITY DEAL.' The camera angle is static, capturing both individuals from the front. There are no significant actions or changes in the frame at this moment."
    },
    {
      "start_time": 275,
      "end_time": 300,
      "visual": "The scene continues with Donald Trump and another man standing at podiums with 'TECH PROSPERITY DEAL' written on them. They are flanked by US and UK flags. The background features ornate wall decorations. The man on the right gestures while speaking, and Trump stands still, looking down. At 325s, Trump briefly looks up before returning his gaze downward."
    },
    {
      "start_time": 300,
      "end_time": 325,
      "visual": "The scene continues with Donald Trump and another man standing at their respective podiums. The setting remains consistent, with the flags of the United States and the United Kingdom behind them. Both men are dressed formally, with Trump wearing a dark suit and red tie, and the other man in a dark suit and glasses. The podiums have signs reading 'TECH PROSPERITY DEAL.' The camera angle remains steady, focusing on the two men as they continue their discussion."
    },
    {
      "start_time": 325,
      "end_time": 350,
      "visual": "The scene continues with Donald Trump and another man standing at their respective podiums. The setting remains consistent with the previous frames, featuring the flags of the United States and the United Kingdom behind them. Both men are dressed formally, with Trump wearing a dark suit and red tie, and the other man in a dark suit and glasses. The podiums have signs that read 'TECH PROSPERITY DEAL.' The man at the right podium continues to speak, using hand gestures to emphasize his points."
    },
    {
      "start_time": 350,
      "end_time": 375,
      "visual": "The scene continues with Donald Trump and another man standing at their respective podiums. The setting remains consistent, with the flags of the United States and the United Kingdom behind them. Both men are dressed formally, with Trump wearing a dark suit and red tie, and the other man in a dark suit and glasses. The podiums have signs that read 'TECH PROSPERITY DEAL.' The man at the right podium continues to speak, using hand gestures to emphasize his points. The camera angle remains steady, focusing on both individuals."
    },
    {
      "start_time": 375,
      "end_time": 400,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. The setting includes wooden paneling and framed portraits on the walls, adding a formal and historical ambiance to the room. Donald Trump is seen speaking at his podium, while the man beside him listens attentively. The audience appears engaged, with some members looking towards the speakers."
    },
    {
      "start_time": 400,
      "end_time": 425,
      "visual": "The camera angle shifts to show the audience seated in front of the podiums. The setting includes wooden paneling and framed portraits on the walls, adding a formal and historical ambiance to the room. Donald Trump is seen speaking at his podium, while the man beside him listens attentively. The audience appears engaged, with some members looking towards the speakers. The lighting remains consistent, highlighting the podiums and the individuals standing behind them."
    },
    {
      "start_time": 425,
      "end_time": 450,
      "visual": "The scene shows Donald Trump speaking at the podium. The setting remains consistent, featuring the US and UK flags behind him. The camera angle is slightly wider, revealing more of the room and some of the audience seated in front of the podiums. At 444s, the man on the right side of the screen picks up a black folder or document. The scene then transitions to a black screen with the word 'mint' in orange letters, along with social media icons and a subscription button."
    }
  ]
}