{
  "scenes": [],
  "error": "Failed to parse JSON",
  "raw_output": "{\n  \"scenes\": [\n    {\n      \"start_time\": 0,\n      \"end_time\": 25,\n      \"visual\": \"The video begins with a black screen featuring white text that reads 'INDIA IN DETAILS.' This transitions to a distorted image of Mount Rushmore with an American flag overlay. A blue banner appears at the bottom with the text 'Russia's war machine?' in white. A woman with shoulder-length blonde hair, wearing a patterned dress, stands in front of a wooden fence with a rural landscape in the background. She has her right hand on her hip and looks directly at the camera. The blue banner changes to display the text 'still buying Russian gas' in white. The scene then shifts to a screenshot of a webpage titled 'Who is buying Russia's fossil fuels?' The page displays bar graphs comparing imports of oil, coal, and petroleum products from Russia. The blue banner changes to 'Why is the European Union still funding' in white. Another webpage with the headline 'EU devours Russian gas at record speed despite cutoff' appears. The blue banner changes to 'Why, why, why?' in white. The woman reappears in the same setting as before, now with her hands on her hips. The blue banner changes to 'independence. It does not want to' in white.\"\n    },\n    {\n      \"start_time\": 25,\n      \"end_time\": 50,\n      \"visual\": \"The video shows a woman standing in front of a wooden fence with a rural landscape in the background. She is wearing a patterned dress and has her hands on her hips. The scene then transitions to a screenshot of a tweet by Donald Trump, which reads, 'Looks like we've lost India and Russia to deepest, darkest, China.' Following this, the woman reappears, now with her arms crossed, continuing her commentary. The background remains consistent with the rural landscape.\"\n    },\n    {\n      \"start_time\": 50,\n      \"end_time\": 75,\n      \"visual\": \"The video shows a close-up shot of a man in a maroon beret, followed by another man in a similar uniform. The camera then zooms out to reveal the side of an airplane with 'भारत' written on it, indicating that this is an Indian Air Force plane. A man in a light-colored vest and white pants descends the stairs of the airplane and shakes hands with another man in a dark suit. They walk away together, accompanied by two other men in suits. The background includes the airplane and the tarmac, providing context to the setting.\"\n    },\n    {\n      \"start_time\": 75,\n      \"end_time\": 100,\n      \"visual\": \"The video displays a tweet by Gunther Fellnagel-Jahn, which includes a map of India and text discussing a new world order led by China, Russia, and India. The tweet suggests dismantling NATO and inviting successor states to join the Shanghai Cooperation Organization (SCO). Another tweet by the same user is shown, calling for the dismantling of India into Modas-stabilized Ukraine and suggesting European Union countries join NATO to win against Russia and China. The tweet also mentions Shangri-La Summit and Pardeep Sidhu. Dr. Jaishankar appears in a black and white video clip, speaking about Trump's character. A list titled 'Please do not plagiarize/translate our work' is displayed, containing four numbered points criticizing the USA and its actions. The first point accuses the USA of being the champion of Western genocide, colonialism, and criminal democracy. The second point questions why the USA considers itself the center of the West. The third point criticizes Jaishankar's remarks about Trump and how the USA profited from Indian deaths. The fourth point discusses the American Empire versus India, questioning who will win. The list concludes with a request for financial support through PayPal, Google Pay, and UPI.\"\n    },\n    {\n      \"start_time\": 100,\n      \"end_time\": 125,\n      \"visual\": \"The video shows a cartoon image of Donald Trump with a downward-trending graph and Indian rupee coins, suggesting a financial theme. A woman dressed in traditional Indian attire holds a trident against the backdrop of the Indian flag, symbolizing strength or power. A distorted image of Donald Trump appears, possibly indicating a negative portrayal. Mount Rushmore is shown with the setting sun behind it, highlighting its grandeur. A tweet from Donald Trump is displayed, featuring an image of Mount Rushmore with his face superimposed, suggesting a connection between him and the monument. The text accompanying these visuals often references themes of ownership and historical significance, particularly regarding Mount Rushmore's location on Native American land.\"\n    },\n    {\n      \"start_time\": 125,\n      \"end_time\": 150,\n      \"visual\": \"The video shows a tweet from Donald Trump overlaid on an image of Mount Rushmore. The tweet reads, 'Yes, the brutal truth that the USA is still not the rightful owner of Mount Rushmore. Yes, you heard that right!' This is followed by a scene where a woman stands in front of a wooden fence, speaking to the camera. She is wearing a patterned dress and has her arms crossed. The background shows a rural landscape with houses and trees. The video transitions to a webpage titled 'Mount Rushmore' from the National Park Service website. The page includes a photo of Mount Rushmore and text describing its location and significance. The text mentions that Mount Rushmore is located in the Black Hills of South Dakota and is sacred to the Lakota people. It also notes that the land was seized by the U.S. government after gold was discovered in 1877. The woman continues to speak in front of the fence, emphasizing the historical context of Mount Rushmore.\"\n    },\n    {\n      \"start_time\": 150,\n      \"end_time\": 175,\n      \"visual\": \"The video shows a series of frames related to Mount Rushmore. A screenshot of a webpage from the United Nations Human Rights Office of the High Commissioner discusses the history of the Black Hills and mentions the discovery of gold in 1877, which led to the passage of the Congressional Act that transferred ownership of the Black Hills to the United States. Another screenshot from Britannica explains that Mount Rushmore National Memorial is a colossal sculpture featuring four-foot representations of U.S. presidents. It details the construction process, mentioning that the faces of these presidents were carved into the sacred land of the Lakota people. The woman in the patterned dress is seen standing in front of a wooden fence, speaking to the camera. Her expressions and gestures suggest she is discussing the historical context and significance of Mount Rushmore.\"\n    },\n    {\n      \"start_time\": 175,\n      \"end_time\": 200,\n      \"visual\": \"The video shows a woman standing in front of a wooden fence with her arms crossed. The background includes greenery and a house, suggesting a residential setting. The scene transitions to a news article headline that reads, 'US should return stolen land to Indian tribes, says United Nations.' The text on the page discusses the history of the Black Hills and mentions the discovery of gold in 1877, which led to the passage of the Congressional Act that transferred ownership of the Black Hills to the United States. It also notes that indigenous peoples have sought to recover the Black Hills since then. The video then returns to the woman, who continues her commentary on the situation.\"\n    },\n    {\n      \"start_time\": 200,\n      \"end_time\": 225,\n      \"visual\": \"The video presents a series of frames that focus on Mount Rushmore and related historical content. A screenshot from Britannica appears, questioning whether Mount Rushmore is on sacred Native American land. The image shows the monument with red circles highlighting the faces of the presidents carved into the mountain. Below this, text describes the Great Sioux Nation being forced to surrender their territory and relocate to smaller reservations. The video continues with the same Britannica screenshot, emphasizing the historical context of Mount Rushmore. The text mentions two slave owners and two hostile presidents towards Native Americans, providing a critical perspective on the monument's significance. The video then returns to the woman standing in front of the fence, continuing her commentary.\"\n    },\n    {\n      \"start_time\": 225,\n      \"end_time\": 250,\n      \"visual\": \"The video shows a webpage titled 'Sculptor Gutzon Borglum' displaying a black-and-white photo of Gutzon Borglum, the sculptor of Mount Rushmore. The text provides details about his early years and background. The same webpage continues to show more information about Borglum's life, emphasizing his role in creating the monument and his contributions to the significance of Mount Rushmore as a symbol of American democracy. The video then transitions to a YouTube video titled 'Mount Rushmore: A proud symbol of America,' featuring a man in a suit speaking at a podium with the words 'The White House' visible behind him. The video shows a long shot of Mount Rushmore, emphasizing its grandeur and prominence as a national landmark.\"\n    },\n    {\n      \"start_time\": 250,\n      \"end_time\": 275,\n      \"visual\": \"The video shows Donald Trump speaking at a podium with two other individuals standing behind him. The scene then transitions to a view of Mount Rushmore, with cars driving past on a road below. The woman in the patterned dress reappears, continuing her commentary. The background remains consistent with trees and a wooden fence. The video then cuts back to Mount Rushmore, showing the monument against a cloudy sky. Finally, the woman is seen again, still standing in front of the fence, continuing her discussion.\"\n    },\n    {\n      \"start_time\": 275,\n      \"end_time\": 300,\n      \"visual\": \"The video shows the woman standing in front of the wooden fence, continuing her commentary. The background includes trees and a road. The scene transitions to a webpage displaying statistics about Russia's exports, highlighting that the European Union (EU) was the largest buyer of Russian LNG, crude oil, and pipeline gas. The text on the screen provides specific percentages for each product. The woman continues to speak in front of the fence until the end of this segment.\"\n    },\n    {\n      \"start_time\": 300,\n      \"end_time\": 325,\n      \"visual\": \"The video begins with a screenshot of a webpage titled 'Trade in Goods with Russia.' The page displays tables showing U.S. exports, imports, and trade balance with Russia for the years 2023 and 2024. The camera zooms in on the table for 2024, highlighting the import values. A female reporter appears in front of a rural landscape, discussing the U.S. imports from Russia. She mentions that these imports have been increasing since Crimea's annexation in 2014. The scene then shifts to a handshake between two men in suits at a formal meeting, symbolizing diplomatic relations. The video returns to the reporter, who continues her commentary.\"\n    },\n    {\n      \"start_time\": 325,\n      \"end_time\": 350,\n      \"visual\": \"The video shows flags of various countries, including Brazil, Russia, India, China, and South Africa, arranged horizontally. This arrangement suggests a focus on BRICS nations. The scene then shifts to a close-up shot of three men in suits engaged in conversation. The man in the center appears to be the focal point, possibly indicating his importance in the context of the discussion. The setting seems formal, suggesting a diplomatic or business meeting. The video transitions to a screen displaying a list of points, with the third point highlighted. This point discusses India's involvement in the US-led war in Afghanistan and its financial implications. The text is clear and emphasizes the economic aspect of the conflict. The scene then shifts back to the woman standing in front of the fence, continuing her commentary. Finally, the video displays a news article headline questioning why former US President Trump aided Navarro in criticizing Indian Prime Minister Modi.\"\n    },\n    {\n      \"start_time\": 350,\n      \"end_time\": 375,\n      \"visual\": \"The video shows a news article headline questioning why Trump aided Navarro in asking Modi why he is 'getting into bed with Putin and Xi.' The article includes images of two individuals, likely related to the discussion. The scene transitions to a man in military attire sitting next to Donald Trump, with a caption stating that India is not like the West and its civilization is not the same. The video then returns to the woman standing in front of the fence, continuing her commentary.\"\n    },\n    {\n      \"start_time\": 375,\n      \"end_time\": 400,\n      \"visual\": \"The video shows a handshake between two men in suits at a table with documents, followed by a close-up of a spreadsheet displaying trade figures. The scene then transitions to a Reuters news article headline stating, 'Three years into war, US and Europe keep billions in trade with Russia.' This is followed by a screenshot of a webpage titled 'U.S. IMPORTS FROM RUSSIA' with a highlighted section showing import figures. The video then returns to the woman standing in front of the fence, continuing her commentary. Finally, the video displays flags of various countries, including Brazil, Russia, India, China, and South Africa, arranged horizontally.\"\n    },\n    {\n      \"start_time\": 400,\n      \"end_time\": 425,\n      \"visual\": \"The video shows a screenshot of a YouTube video featuring Dr. S Jaishankar speaking into a microphone. The text overlay reads, 'We well not had a US president who has conducted foreign policy as publicly as the current one...' This scene emphasizes India's independent foreign policy stance. The video then displays a QR code and payment information, encouraging viewers to support the channel financially. The text includes details such as a UPI QR code, Paytm, GooglePay, and UPI payment options, along with an email address. The video returns to the woman standing in front of the fence, continuing her commentary.\"\n    },\n    {\n      \"start_time\": 425,\n      \"end_time\": 450,\n      \"visual\": \"The video shows a news article headline questioning why Trump aided Navarro in asking Modi why he is 'getting into bed with Putin and Xi.' The article includes images of two individuals, likely related to the discussion. The scene transitions to a man in military attire sitting next to Donald Trump, with a caption stating that India is not like the West and its civilization is not the same. The video then returns to the woman standing in front of the fence, continuing her commentary.\"\n    },\n    {\n      \"start_time\": 450,\n      \"end_time\": 475,\n      \"visual\": \"The video shows a screenshot of a YouTube video featuring Dr. S Jaishankar speaking into a microphone. The text overlay reads, 'We well not had a US president who has conducted foreign policy as publicly as the current one...' This scene emphasizes India's independent foreign policy stance. The video then displays a QR code and payment information, encouraging viewers to support the channel financially. The text includes details such as a UPI QR code, Paytm, GooglePay, and UPI payment options, along with an email address. The video returns to the woman standing in front of the fence, continuing her commentary.\"\n    },\n    {\n      \"start_time\": 475,\n      \"end_time\": 500,\n      \"visual\": \"The video shows a wide shot of a building with multiple flags flying in front of it. The flags appear to be British, as indicated by their design. This visual suggests a focus on the UK. The scene then transitions to a close-up of a stone archway with inscriptions in both Hindi and English. The English inscription reads 'ONE EARTH ONE FAMILY ONE FUTURE,' which suggests a theme of global unity or cooperation. The video then shows a man in a suit and tie speaking at a podium labeled 'THE WHITE HOUSE WASHINGTON.' He gestures with his right hand, and two other individuals stand behind him, clapping. The video then shows a person wearing a red baseball cap sitting at a desk. They slam their hands on the desk, and the camera zooms in slightly. The video returns to the woman standing in front of the fence, continuing her speech.\"\n    },\n    {\n      \"start_time\": 500,\n      \"end_time\": 525,\n      \"visual\": \"The video shows a close-up shot of a map of Europe, focusing on Germany. A green pushpin is placed on Berlin, indicating its location. The map shows various countries such as Denmark, Poland, and the Netherlands. The scene then transitions to a woman in a blue dress shaking hands with a man in a light-colored vest. They exchange smiles, and another man in a suit joins them, also smiling. The background appears to be a formal setting, possibly a conference or meeting room. The video then shows a man wearing a red cap sitting at a desk. A person in a suit approaches him and places a framed picture on the desk. The man at the desk then raises his hands in a gesture of approval. The video then shows two men shaking hands in front of a large circular design, possibly a logo or emblem. The man on the left wears a dark suit, while the man on the right wears a light-colored traditional outfit. The scene then transitions to a tweet from Donald Trump praising Narendra Modi as a great Prime Minister.\"\n    },\n    {\n      \"start_time\": 525,\n      \"end_time\": 550,\n      \"visual\": \"The video shows a tweet from Donald Trump praising Narendra Modi. The tweet is displayed on the screen with Trump's image and text highlighting their friendship. Following this, another tweet is shown, this time from Narendra Modi expressing gratitude for Trump's statements. The tweet includes Modi's image and text thanking Trump. The video then transitions to a scene showing a man with a beard and bare torso sitting on the ground, eating something. This is followed by an image of a person pointing towards a celestial body, which appears to be a depiction of ancient Indian astronomy. The text accompanying these images emphasizes India's ancient civilization and its contributions. The video then returns to the woman in the patterned dress standing with her arms crossed in front of the wooden fence.\"\n    },\n    {\n      \"start_time\": 550,\n      \"end_time\": 575,\n      \"visual\": \"The video shows a man in a suit speaking at a podium with a presidential seal. The scene then transitions to a close-up of a man with a long white beard and orange clothing, possibly a religious figure. The video then shows a screenshot of a news article titled 'Is Mount Rushmore on sacred Native American land?' The article includes images of Mount Rushmore and a flagpole flying the American flag. The video then shows a large conference room with people seated around a circular table, and then focuses on a man with a white beard and glasses speaking at a podium with two microphones. Finally, the video returns to the woman in the patterned dress standing with her arms crossed in front of the wooden fence.\"\n    },\n    {\n      \"start_time\": 575,\n      \"end_time\": 600,\n      \"visual\": \"The video shows the woman standing in front of the wooden fence, continuing her commentary. The background"
}